{
    "main": {
        "name": "Tobi Oladimeji",
        "occupation": "Data Analyst",
        "description": "On a mission to make data-driven decision-making accessible to small businesses. Let's connect and explore how we can leverage my expertise to drive growth and success for your business.",
        "image": "tobiolad.jpg",
        "bio": "Hello, I'm Tobi Oladimeji, a seasoned data analyst with a diverse background in data migration, geospatial analysis, and business intelligence. My experience spans multiple industries, including finance, oil production, and digital marketing. I specialize in leveraging tools like SQL, Excel, Power BI, Python, and various other technologies to drive data-driven decision-making and enhance operational efficiency. As a community leader, I also founded Data Fellows, a thriving data community with over 300 active members. I'm passionate about sharing knowledge and fostering collaboration. I believe in the power of effective communication, adaptability, and teamwork, among other qualities, to drive success in any project or organization.",
        "contactmessage": "Let's connect and explore how I can contribute to your team's goals.",
        "email": "oluwatobilobadimeji@gmail.com",
        "phone": "+234 807 997 6826",
        "address": {
            "street": "",
            "city": "Nigeria",
            "state": "",
            "zip": ""
        },
        "website": "#",
        "resumedownload": "https://docs.google.com/document/d/10RBKCKjDGEmfeYyEfK6kG_FnpSRemU9AS67vdv7h3q8/edit?usp=sharing",
        "social": [
            {
                "name": "facebook",
                "url": "https://www.facebook.com/tobioladimeji01/",
                "className": "fa fa-facebook"
            },
            {
                "name": "linkedin",
                "url": "https://www.linkedin.com/in/tobioladimeji/",
                "className": "fa fa-linkedin"
            },
            {
                "name": "instagram",
                "url": "https://www.instagram.com/tobioladimeji_/",
                "className": "fa fa-instagram"
            },
            {
                "name": "github",
                "url": "https://github.com/tobiolad/",
                "className": "fa fa-github"
            }
        ]
    },
    "resume": {
        "skillmessage": "Here are some of the skills I got to pick up.",
        "education": [
            {
                "school": "Landmark University, Omu-Aran",
                "degree": "BSc in Computer Science",
                "graduated": "2022",
                "description": ""
            },
            {
                "school": "Conestoga College",
                "degree": "PGd in Business Analytics",
                "graduated": "2024",
                "description": ""
            }
        ],
        "work": [
            {
                "company": "Conestoga College",
                "title": "OER Assistant",
                "years": "May 2024 - Present",
                "description": "As an OER Assistant, I leverage my technical expertise to optimize open learning practices and streamline processes. Collaborating closely with Open Learning staff, I contribute to the creation, review, and refinement of digital text materials using a diverse array of technologies such as Word, PDF, Pressbooks, and H5P, prioritizing accessibility and effectiveness in content delivery. Additionally, I apply my proficiency in Large Language Models (LLM) and machine learning to assist in the detection and mitigation of plagiarism, further enhancing the integrity of educational resources."
            },
            {
                "company": "ESGTree",
                "title": "Data Analyst & ML Engineer",
                "years": "February 2024 - Present",
                "description": "In my role as a Data Analyst & ML Engineer at ESGTree. I provide expert support for client requests, utilizing my proficiency in PowerBI and fostering collaboration with data engineers to ensure efficient and effective solutions. Additionally, I contribute valuable insights to architecture modernization and refactoring efforts, aiming to enhance system efficiency and scalability. Moreover, I actively participate in Machine Learning projects focused on document processing, leveraging Large Language Models (LLM) to drive innovation and achieve project objectives."
            },
            {
                "company": "PwC",
                "title": "Data Analyst",
                "years": "September 2022 - November 2023",
                "description": "In my role as Data Analyst at PwC, I was actively involved in a data migration project for a prominent player in the Nigerian food and agroallied sector. My responsibilities include conducting comprehensive data mapping, collaborating with stakeholders to develop custom scripts, and utilizing SSIS for real-time data monitoring. I also provided training and played a pivotal role in assignment management."
            },

            {
                "company": "Rollback Ally",
                "title": "Lead Data Analyst",
                "years": "February 2023 - September 2023",
                "description": "In my role as Lead Data Analyst at Rollback Ally, I successfully led the SeismoWatch project, monitored seismic events in Colombian oil-producing zones, and implemented ArcGIS and Power BI for data analysis. I also developed automated alert systems, managed databases, and generated business review reports."
            },
            {
                "company": "Metridash",
                "title": "Business Intelligence Analyst",
                "years": "Jan 2023 - May 2023",
                "description": "I developed social media strategies, participated in various roles, contributed to growth initiatives, conducted market research, and contributed to lead generation strategies."
            },
            {
                "company": "Data Fellows",
                "title": "Founder and Data Community Lead",
                "years": "Aug 2022 - Present",
                "description": "As the founder and community lead of Data Fellows, a community dedicated to data professionals, I facilitate knowledge sharing, resource exchange, and networking among over 500 members. Data Fellows is aligned with Netsys Consult's consulting services, furthering our mission to empower individuals in the data field."
            },
            {
                "company": "Analytic Company GmbH",
                "title": "Data Analyst",
                "years": "May 2022 - Nov 2022",
                "description": "I managed vehicle data, applied regular expressions for data enhancement, conducted quality checks, and improved data entry processes."
            },
            {
                "company": "Entrylevel",
                "title": "Data Analyst Intern",
                "years": "March 2021 - Nov 2021",
                "description": "I excelled in the Data Analyst Virtual Experience program, showcasing proficiency in SQL, data analytics tools, data visualization, and problem-solving."
            },
            {
                "company": "Quantum Analytics",
                "title": "Data Analyst Intern",
                "years": "Sep 2021 - Oct 2021",
                "description": "I worked with Excel, PowerBI, and data cleaning tools to enhance data analysis capabilities and generate data-driven insights."
            },
            {
                "company": "AgroMall",
                "title": "Data Analyst Intern",
                "years": "Mar 2021 - Oct 2021",
                "description": "I designed dashboards, managed databases, and conducted data analysis to inform decision-making."
            }
        ],
        "skills": [
            {
                "name": "Python",
                "level": "70%"
            },
            {
                "name": "SQL",
                "level": "85%"
            },
            {
                "name": "Microsoft PowerPoint",
                "level": "80%"
            },
            {
                "name": "Microsoft PowerBI",
                "level": "90%"
            },
            {
                "name": "Market Research",
                "level": "70%"
            },
            {
                "name": "Microsoft Excel",
                "level": "90%"
            },
            {
                "name": "Tableau",
                "level": "70%"
            },
            {
                "name": "Microsoft SQL Server",
                "level": "80%"
            },
            {
                "name": "ArcGIS",
                "level": "60%"
            }
        ]
    },
    "portfolio": {
        "projects": [
            {
                "title": "AgroWallet Dashboard",
                "category": "PowerBI",
                "description": "Visualization of AgroMall Farmer's Information such as age,farm size, agents, loans taken by farmers, amount disbursed and total amount repaid.",
                "image": "agrowallet.png",
                "url": "https://app.powerbi.com/view?r=eyJrIjoiOTQ2ZTQ4NjYtZTQ4ZC00NzQ2LTkyOTMtZGVhYmM3NzcyMGRmIiwidCI6IjQxZDdjZDQ4LWQ2MzQtNDIyZi1hNmNjLWVlNTUxNDFhOTJkNSJ9"
            },
            {
                "title": "Corona Dashboard",
                "category": "PowerBI",
                "description": "Visualization of Corona Virus Pandemic as at 26 July 2021, details like number of countries affected, confirmed cases and deaths.",
                "image": "corona.png",
                "url": "https://app.powerbi.com/view?r=eyJrIjoiM2Y5NzVlZmYtYTkyNC00ZWJlLWI2M2YtZDA0MTcxMmQ3YWM1IiwidCI6IjQxZDdjZDQ4LWQ2MzQtNDIyZi1hNmNjLWVlNTUxNDFhOTJkNSJ9"
            },
            {
                "title": "M & E Dashboard",
                "category": "PowerBI",
                "description": "Visualizing the monitoring and evaluation dataset of AgroMall, details like Pending Visits, Number of States visited e.t.c",
                "image": "m & e.png",
                "url": "https://app.powerbi.com/view?r=eyJrIjoiOGYwZDU0MzYtNGYwOC00YTEzLTk1MjMtNDY3MmMwMGRjZGZlIiwidCI6IjQxZDdjZDQ4LWQ2MzQtNDIyZi1hNmNjLWVlNTUxNDFhOTJkNSJ9"
            },
            {
                "title": "Logistics Dashboard",
                "category": "PowerBI",
                "description": "Analyzing and visualizing the logistics transport data of AgroMall, details like different truck vendors, products available for movement and status of truck vendor.",
                "image": "logistics.png",
                "url": "https://app.powerbi.com/view?r=eyJrIjoiNTM3NjI5NzgtYTQyZS00YTk3LTg1MzEtYzQyODgyYTRlM2Q5IiwidCI6IjQxZDdjZDQ4LWQ2MzQtNDIyZi1hNmNjLWVlNTUxNDFhOTJkNSJ9"
            },
            {
                "title": "Olympics Dashboard",
                "category": "PowerBI",
                "description": "Analyzing and visualizing the olympics dataset gotten from Quantum Analytics to derive insights, identify patterns and trends in data using PowerBI, Excel and SQL",
                "image": "olympics analysis-.png",
                "url": "https://app.powerbi.com/view?r=eyJrIjoiM2M5MzEzM2YtZjIzZi00NTJmLTlkYTMtNWUyNDc1MzkzYjk3IiwidCI6IjQxZDdjZDQ4LWQ2MzQtNDIyZi1hNmNjLWVlNTUxNDFhOTJkNSJ9"
            },
            {
                "title": "Library Management System",
                "category": "SQL",
                "description": "For this project, I’ll be analyzing data from a Library Management System (LMS) database. The LMS database consists of several tables representing different aspects of library operations, including books, borrowers, branches, and book loans.",
                "image": "library.png",
                "url": "https://medium.com/@Tobioladimeji_/testing-sql-skills-a-deep-dive-into-lms-databases-98d7dd808604"
            },
            {
                "title": "Ontario Community Project",
                "category": "SQL",
                "description": "This project focuses on analyzing infrastructure projects in Ontario, Canada, using data from the Welcome Ontario dataset. The dataset contains valuable information about key infrastructure projects across various communities in Ontario, including project details, budgets, statuses, and completion dates. The objective of this project is to extract insights from the data to inform decision-making and project management within government infrastructure and community development initiatives.",
                "image": "ont_communities.jpg",
                "url": "https://github.com/tobiolad/ont-communities"
            },
            {
                "title": "Tire Price Analysis",
                "category": "Python",
                "description": "Our dataset comprises 4350 samples detailing various attributes of automotive tires, from brand and model to pricing and customer ratings. We chose this dataset to explore the dynamics of tire pricing and customer preferences within the automotive industry. Our decision stems from the critical role tires play in vehicle performance and safety, making understanding market trends essential for manufacturers and suppliers. With a focus on data-driven decision-making, our project aims to provide actionable insights to optimize procurement processes and enhance product quality.",
                "image": "tire_price.jpg",
                "url": "https://github.com/tobiolad/tire-price-analysis"
            },
            {
                "title": "Dividend Policy Predictor",
                "category": "Python",
                "description": "The goal of this project is to build and optimize a machine learning model that would predict if a particular company would cut its dividend shares at a particular time. All companies within S&P500 index.",
                "image": "indian.jpg",
                "url": "https://github.com/PeiqiAlan/Dividend-Policy-Forecast"
            },
            {
                "title": "Canada Economic Freedom",
                "category": "Python",
                "description": "In a discussion, we debated whether Canada is an opportunity, threat, or unknown. My position was that Canada is an opportunity due to its economic importance, political stability, high quality of life, and multicultural society. These factors make Canada attractive for immigrants and businesses, fostering innovation and providing a solid foundation for long-term growth.",
                "image": "canada_economic.jpeg",
                "url": "https://github.com/tobiolad/Economic-Freedom"
            },
            {
                "title": "Real-Time Seismic Event Monitoring Solution",
                "category": "ArcGIS",
                "description": "In a recent project focused on the oil and gas sector, I had to go on an exciting journey into the world of geospatial analysis using ArcGIS, a tool I had never used before. Despite hearing a lot about geography and GIS, I had never had the opportunity to explore its capabilities firsthand. The aim of this project, aptly named “SEISMO WATCH,” was to develop a real-time seismic event monitoring solution using live data from the US Geological Survey (USGS).",
                "image": "seismic.png",
                "url": "https://medium.com/@Tobioladimeji_/exploring-geospatial-analysis-building-a-real-time-seismic-event-monitoring-solution-a0c197a52c61"
            }
        ]
    },
    "testimonials": {
        "testimonials": [
            {
                "text": "Tobi is an outstanding young professional with so much potential. During our time at PwC, I witnessed his dedication to mastering data analysis. Tobi's ability to tackle complex data challenges and his eagerness to learn set him apart. He's not just a team player but also brings a fresh perspective to every project. I highly recommend Tobi for his skills, passion, and the promise he holds in the field of data analytics",
                "user": "Andrew S Nevin"
            },
            {
                "text": "It was a great pleasure to have worked with Tobi. He is a very responsible, determined, and hard working profesional. Tobi really helped us in analyzing data and report generation for various clients,developing them in PowerBi and integrating databases. Constantly solved problems and proposed new ideas. Tobi was always a team player and was invested in making things work. Apart from being a great profesional he is a great person.",
                "user": "Edgardo Jaramillo"
            },
            {
                "text": "Tobi is a highly skilled and experienced data analyst with a deep understanding of data mining, statistical analysis, and data visualization! I highly recommend them for any data analyst role.",
                "user": "Andrea Verhelst"
            },
            {
                "text": "Tobi's excepcional patience, professionalism, and capability to understand and work with disorganized data sets have turned him into an asset for our team. I admire his capacity to create reports from scratch in Power BI and connect various platforms to turn simple datasets added to a Google Sheets into meaningful reports for making informed decisions. Of course, he is a great coworker, and I can wholeheartedly recommend Tobi without any doubt.",
                "user": "Daniela Titus"
            },
            {
                "text": "I wholeheartedly recommend Tobi for his exceptional contributions at Rollbackally. From the moment he joined our team, it was clear that he possessed a remarkable ability to adapt, coupled with a strong work ethic that consistently translated into outstanding results. Tobi’s dedication to his work is truly commendable, and his talent shines through in all that he undertakes. He is not only a skilled professional but also a natural leader who knows how to guide the team effectively toward achieving our goals. I am confident that Tobi will continue to excel in any role he takes on in the future.",
                "user": "Santiago Guevara León"
            }
        ]
    }
}
